using Animations;
using Computers;
using UnityEngine;
using System.Collections;
using Places;

public class OperationsExecuter : OperationsExecuterBase
{

    //=========================================================================================================================================================
    // Думать
    private IEnumerator Think(int time)
    {
        _scholar.Anim.SetAnimation(Get.animations.Thinking);
        yield return new WaitForSeconds(time);

        OperationEnd();
    }



    //=========================================================================================================================================================
    // Писать экзамен
    private IEnumerator Write(int time)
    {
        _scholar.Anim.SetAnimation(Get.animations.Writing);
        yield return new WaitForSeconds(time);

        OperationEnd();
    }



    //=========================================================================================================================================================
    //Пописать
    private IEnumerator Pee(int index)
    {
        _scholar.Anim.SetAnimation(Get.animations.Peeing);
        yield return new WaitForSeconds(index);

        OperationEnd();
    }



    //=========================================================================================================================================================
    //Помыл руки
    private IEnumerator Wash_Hands(int index)
    {
        _scholar.Anim.SetAnimation(Get.animations.Washing_Hands);
        yield return new WaitForSeconds(index);

        OperationEnd();
    }



    private IEnumerator Think_Outside(int index)
    {
        _scholar.Anim.SetAnimation(Get.animations.Thinking_Outside);
        yield return new WaitForSeconds(index);

        OperationEnd();
    }




    //=========================================================================================================================================================
    //Достать бумажку и посмотреть в нее

    private IEnumerator Note()
    {
        _scholar.Anim.SetAnimation(Get.animations.Take_Out);

        yield return new WaitForSeconds(0.25f);

        _scholar.Objects.Hold(ScholarObjectsManager.objectType.Note);

        yield return new WaitForSeconds(0.5f);

        _scholar.Anim.SetAnimation(Get.animations.Take_Up);

        yield return new WaitForSeconds(5f);

        _scholar.Objects.ThrowOut();

        _scholar.Anim.SetAnimation(Get.animations.Nothing);

        OperationEnd();
    }



    //=========================================================================================================================================================
    //Думание вслух

    private IEnumerator Think_Aloud()
    {
        _scholar.Anim.SetAnimation(Get.animations.Thinking_Aloud);
        _scholar.Talk.SayThoughts("Think_Aloud");

        while(_scholar.Talk.Talking)
            yield return new WaitForEndOfFrame();

        OperationEnd();
    }








    //=========================================================================================================================================================
    //=========================================================================================================================================================
    //=========================================================================================================================================================
    //=========================================================================================================================================================
    //=========================================================================================================================================================
    //=========================================================================================================================================================
    //=========================================================================================================================================================
    //=========================================================================================================================================================
    //=========================================================================================================================================================
    //=========================================================================================================================================================
    //=========================================================================================================================================================
    //Списывание
    //=========================================================================================================================================================




}
